# InstanceHeadHeightParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InstanceHeadHeightParam Property
ParameterTypeId Class See Also
---
"Head Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InstanceHeadHeightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceHeadHeightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InstanceHeadHeightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace